// Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.
// Нельзя использовать функцию Math.Pow()!
// 3, 5 -> 243 (3⁵)

// 2, 4 -> 16

// Console.Clear();
// Console.Write("Введите первое число: ");
// int n = Convert.ToInt32(Console.ReadLine());

// Console.Write("Введите второе число: ");
// int m = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine($"{n} ^ m ");


// for (int i = 1; i <= n; i++)
//     Console.WriteLine($"{n} ^ m = {m * m * m}");